<?php
/**
 * Created by PhpStorm.
 * User: su
 * Date: 2018/1/5
 * Time: 10:19
 */

namespace trhui\data;

class ResultCode
{
    /**
     * 返回代码
     */
    const RESULT_CODE = array(

        //  公共返回
        '100' => '操作成功',
        '999' => '交易异常',
        //  二位数的是通用异常
        '01' => '商户号错误',
        '02' => '会员ID错误',
        '03' => '金额错误',
        '04' => '商户平台余额不足',
        '05' => '会员余额不足',
        '06' => '会员未绑定该商户',
        '07' => '商户账号不存在',
        '08' => '会员账号不存在',
        '09' => '非法的请求参数',
        '10' => '请求参数解析异常',
        '11' => '已冻结资金余额不足',
        '12' => '订单号已经存在',
        '13' => '商户服务及费用未设置',
        '14' => '资金校验失败',
        '15' => '会员未实名认证',
        //  三位数的是业务异常
        //  1.开头的是注册/授权接口
        '101' => '手机号已经被注册',
        '102' => '实名认证失败',
        '103' => '实名认证失败，身份证号已经存在！',
        '104' => '已开户，已实名认证',
        '105' => '已开户，未实名认证',
        '106' => '绑定银行卡失败(已认证成功)',
        //  2.开头的是支付接口
        '201' => '签名失败',
        '202' => '验签失败',
        '203' => '商户未开通这项支付服务',
        '204' => '商户支付时手续费支付对象错误',
        '205' => '支付金额太小',
        '206' => '银行网银编号错误',
        '207' => '支付方式,不能为空',
        '208' => '订单已处理',
        //  3.开头的是提现接口
        '301' => '银行卡错误',
        '302' => '会员未绑定该银行卡号',
        '303' => '提现金额少于手续费',
        '304' => '银行卡不存在',
        //  4.开头的是转账接口',
        '401' => '收款人错误',
        '402' => '商户不能转账给自己.',
        '403' => '转账方式错误',
        '404' => '业务类型错误',
        '405' => '付款方类型错误错误',
        '406' => '收款金额总额出错',
        '407' => '付款人不能转账给自己',
        '408' => '投标收款人只能唯一',
        '409' => '消费收款人只能唯一',
        //  5.开头的是转账审核接口
        '501' => '转账审核返回码：转账方式错误',
        '502' => '转账审核返回码：收款人错误',
        '503' => '转账审核返回码：订单号错误',
        '504' => '转账审核返回码：审核方式错误',
        //  6.绑定提现银行卡(实名认证)
        '601' => '	会员类型错误',
        //  7.企业会员实名认证
        '701' => '会员类型错误',

    );
}